src/Catalogs/КартыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привязка</Name>
					<Comment>клиент, сотрудник, место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйБейдж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКартДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторHEX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыКартДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыКартДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Временная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КартыДоступа/Forms/ФормаЭлемента/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	УправлениеРИБ.ПередОткрытиемЭлементаСправочника(ЭтотОбъект, ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Если ТипЗнч(Привязка) = Тип("СправочникСсылка.ПосадочныеМеста") Тогда
	//	ПредставлениеПривязки = НаимПосадочногоМеста(Привязка);
	//ИначеЕсли Привязка <> Неопределено Тогда
	//	ПредставлениеПривязки = Привязка.Наименование;
	//КонецЕсли; 
	Если Привязка <> Неопределено Тогда
		ПредставлениеПривязки = Привязка.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ЭтоНовый() Тогда
		Наименование = "Карта № " + Код;
	КонецЕсли; 
	
	ФлагПериод1 = ЗначениеЗаполнено(Дата1);
	ФлагПериод2 = ЗначениеЗаполнено(Дата2);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ФлагПериод1 Тогда
		Если НЕ ЗначениеЗаполнено(Дата1) Тогда
			Сообщить("Укажите дату начала периода!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Дата1 = '00010101';
	КонецЕсли;
	
	Если ФлагПериод2 Тогда
		Если НЕ ЗначениеЗаполнено(Дата2) Тогда
			Сообщить("Укажите дату конца периода!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Дата2 = '00010101';
	КонецЕсли;
	
	Если ТипКарты = Перечисления.ТипыКартДоступа.Временная или ТипКарты = Перечисления.ТипыКартДоступа.Постоянная тогда
		//Код = ""+ксТрактир.Число16в10(ксТрактир.Число10в16(Лев(ЭтотОбъект.Идентификатор,3))+ ксТрактир.Число10в16(Сред(Сокрлп(ЭтотОбъект.Идентификатор),4)));
		Номер = ?(ЗначениеЗаполнено(Идентификатор2),Идентификатор2,Идентификатор);
		Наименование = "Карта №"+Номер;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	ЭлементыФормы.Идентификатор.КнопкаВыбора = ЭтоШаблон;
	
	ЭлементыФормы.Дата1				.Доступность = ФлагПериод1;
	ЭлементыФормы.Дата2				.Доступность = ФлагПериод2;
	ЭлементыФормы.КнопкаВыборПериода.Видимость   = ФлагПериод1 И ФлагПериод2;
	
КонецПроцедуры

Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ОбработкаВнешнихСобытий.ПолучитьДанные(Источник, Событие, Данные);
	
	Если ТипКарты = Перечисления.ТипыКартДоступа.Временная тогда
		Код = ""+ксТрактир.Число16в10(ксТрактир.Число10в16(Лев(Идентификатор,3))+ ксТрактир.Число10в16(Сред(Сокрлп(Идентификатор),4)));
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаВыборПериодаНажатие(Элемент)
	
	ИнтерфейсАдмина.ВыборПериода(Дата1,Дата2);
	
КонецПроцедуры

Процедура ПредставлениеПривязкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить("Сотрудники");
	Список.Добавить("Клиенты");
	Список.Добавить("Посадочные места");
	
	Кто = ВыбратьИзМеню(Список);
	Если Кто = Неопределено Тогда 
		Возврат;
	ИначеЕсли Кто.Значение = "Сотрудники" Тогда
		ФормаВыбора = Справочники.Сотрудники.ПолучитьФормуВыбора();
	ИначеЕсли  Кто.Значение = "Клиенты" Тогда
		ФормаВыбора = Справочники.Клиенты.ПолучитьФормуВыбора();
	ИначеЕсли  Кто.Значение = "Посадочные места" Тогда
		ФормаВыбора = Справочники.ПосадочныеМеста.ПолучитьФормуВыбора();
	КонецЕсли;
	
	Привязка = ФормаВыбора.ОткрытьМодально();
	Если НЕ ЗначениеЗаполнено(Привязка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Привязка) = Тип("СправочникСсылка.ПосадочныеМеста") Тогда
		Элемент.Значение = НаимПосадочногоМеста(Привязка);
	Иначе
		Элемент.Значение = Привязка.Наименование;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПредставлениеПривязкиОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = Привязка.ПолучитьФорму("ФормаЭлемента");
	Форма.Открыть();
КонецПроцедуры


Процедура ПредставлениеПривязкиОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеПривязки = "";
	Привязка = Неопределено;
КонецПроцедуры


Процедура Печать()
	ЭтотОбъект.ПечатьКонверта();
КонецПроцедуры


Процедура ПриЗакрытии()
	// Вставить содержимое обработчика.
КонецПроцедуры
